app/controllers/private_controller.rb

  def statistics
    @log_week = current_firm.logs.where(:log_date => (Time.now.beginning_of_week + 1.second)..(Time.now.end_of_day)).group("date(log_date)").sum(:hours)
---
SELECT SUM("logs"."hours") AS sum_hours, date(log_date) AS date_log_date FROM "logs" WHERE "logs"."firm_id" = 1 AND ("logs"."log_date" BETWEEN '2012-03-18 23:00:01.000000' AND '2012-03-21 22:59:59.999999') GROUP BY date(log_date)

   def report_for
  	if !params[:user_id].blank?
  	@user = User.find(params[:user_id])

  	@logs = @user.logs.where(:log_date => (params[:from].to_date + 1.second)..(params[:to].to_date.end_of_day))
  	@projects = @logs.project
  	@logs_hours_by_project = @logs.group("project_id", "date(log_date)")
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
SELECT "logs".* FROM "logs" WHERE "logs"."user_id" = 1 AND ("logs"."log_date" BETWEEN '2012-03-22 00:00:01.000000' AND '2012-03-22 23:59:59.999999') GROUP BY project_id, date(log_date)
SELECT SUM("logs"."hours") AS sum_hours, date(log_date) AS date_log_date FROM "logs" WHERE "logs"."user_id" = 1 AND ("logs"."log_date" BETWEEN '2012-03-22 00:00:01.000000' AND '2012-03-22 23:59:59.999999') GROUP BY date(log_date)

  def timesheets
    @user = current_firm.users.find(params[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."firm_id" = 1 AND "users"."id" = ? LIMIT 1  [["id", "1"]]

  def add_log_timesheet
    @log = Log.new(params[:log])
    @user = @log.user
    @log.tracking = false
    @all_projects =  current_user.projects.where(["active = ?", true])
    @customers = current_firm.customers
    @log.firm = current_firm
 	  @model = "log"
     @model_instanse = @log
    if params[:done]
      if !@log.todo.nil?
         @log.todo.completed = true
         @log.todo.save
---
SELECT "projects".* FROM "projects" INNER JOIN "memberships" ON "projects"."id" = "memberships"."project_id" WHERE "memberships"."user_id" = 1
INSERT INTO "logs" ("begin_time", "created_at", "customer_id", "employee_id", "end_time", "event", "firm_id", "hours", "log_date", "project_id", "todo_id", "tracking", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

	def timesheet_logs_day
		@users = current_firm.users
		@user = current_firm.users.find(params[:user_id])
		@logs = @user.logs.where(:log_date => params[:date].to_time..params[:date].to_time.end_of_day)
		@all_projects = current_user.projects.where(["active = ?", true]).includes(:customer, {:todos => [:logs]})
---
SELECT "users".* FROM "users" WHERE "users"."firm_id" = 1 AND "users"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "logs".* FROM "logs" WHERE "logs"."user_id" = 1 AND ("logs"."log_date" BETWEEN '2012-03-19 00:00:00.000000' AND '2012-03-19 23:59:59.999999')
SELECT "logs".* FROM "logs" WHERE "logs"."todo_id" IN (2)
SELECT "projects".* FROM "projects" INNER JOIN "memberships" ON "projects"."id" = "memberships"."project_id" WHERE "memberships"."user_id" = 1 AND (active = 't')
SELECT "todos".* FROM "todos" WHERE "todos"."project_id" IN (1, 2)

	def timesheet_month
	  range = (Time.now.beginning_of_week.to_date)..(Time.now.beginning_of_week.to_date + 7.days)
	  @date = params[:date].to_time
	  @users = current_firm.users
    @user = current_firm.users.find(params[:user_id])
    @logs = @user.logs.where(:log_date => params[:date].to_time.beginning_of_month..params[:date].to_time.end_of_month)
    @logs_month = @user.logs.where(:log_date => range).group("date(log_date)").sum(:hours)
    @all_projects = current_user.projects.where(["active = ?", true]).includes(:customer, {:todos => [:logs]})
---
SELECT "users".* FROM "users" WHERE "users"."firm_id" = 1 AND "users"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "logs".* FROM "logs" WHERE "logs"."user_id" = 1 AND ("logs"."log_date" BETWEEN '2012-03-23 00:00:00.000000' AND '2012-03-23 23:59:59.999999')
SELECT SUM("logs"."hours") AS sum_hours, date(log_date) AS date_log_date FROM "logs" WHERE "logs"."user_id" = 1 AND ("logs"."log_date" BETWEEN '2012-03-19' AND '2012-03-26') GROUP BY date(log_date)
SELECT "logs".* FROM "logs" WHERE "logs"."todo_id" IN (2)
SELECT "projects".* FROM "projects" INNER JOIN "memberships" ON "projects"."id" = "memberships"."project_id" WHERE "memberships"."user_id" = 1 AND (active = 't')
SELECT "todos".* FROM "todos" WHERE "todos"."project_id" IN (1, 2)

  def logs_pr_date
    @firm = current_user.firm
    @customers = @firm.customers.includes(:employees)
    @all_projects = current_user.projects.where(["active = ?", true]).includes(:customer, {:todos => [:logs]})
---
SELECT "customers".* FROM "customers" WHERE "customers"."firm_id" = 1
SELECT "logs".* FROM "logs" WHERE "logs"."todo_id" IN (2)
SELECT "projects".* FROM "projects" INNER JOIN "memberships" ON "projects"."id" = "memberships"."project_id" WHERE "memberships"."user_id" = 1 AND (active = 't')
SELECT "todos".* FROM "todos" WHERE "todos"."project_id" IN (1)

  def log_range
  	@firm = current_user.firm
    @customers = @firm.customers.includes(:employees)
    @all_projects = current_user.projects.where(["active = ?", true]).includes(:customer, {:todos => [:logs]})
---
SELECT "customers".* FROM "customers" WHERE "customers"."firm_id" = 1
SELECT "employees".* FROM "employees" WHERE "employees"."customer_id" IN (1)
SELECT "logs".* FROM "logs" WHERE "logs"."todo_id" IN (2)
SELECT "projects".* FROM "projects" INNER JOIN "memberships" ON "projects"."id" = "memberships"."project_id" WHERE "memberships"."user_id" = 1 AND (active = 't')
SELECT "todos".* FROM "todos" WHERE "todos"."project_id" IN (1)

  def mark_todo_done
    @firm = current_user.firm

    @todo = Todo.find(params[:id])
    @project = @todo.project
    if @todo.completed == true
      @todo.completed = false
    else
      @todo.completed = true
    end
    @todo.update_attributes(params[:todo])
---
SELECT "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "todos" SET "completed" = 't', "updated_at" = '2012-03-21 10:01:45.331069' WHERE "todos"."id" = 2

def find_logs_on(url, time_range)
    if url == "logs"
      logs_on = current_user
    elsif url == "customers"
      logs_on = Customer.find(params[:id])
    elsif url == "users"
      logs_on = User.find(params[:id])
    elsif url == "projects"
      logs_on = Project.find(params[:id])
    end
      @logs = logs_on.logs.where(:log_date => time_range).order("log_date DESC").includes(:project, :todo, :user, :customer, :employee )
---
SELECT "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "logs".* FROM "logs" WHERE "logs"."customer_id" = 1 AND ("logs"."log_date" BETWEEN '2012-03-21 00:00:00.000000' AND '2012-03-21 23:59:59.000000') ORDER BY log_date DESC