app/views/logs/_log.html.erb

SELECT "projects".* FROM "projects" WHERE "projects"."id" = 1 LIMIT 1
SELECT "todos".* FROM "todos" WHERE "todos"."project_id" IN (1)
---
          <option value>None</option>
          <% log.project.todos.each do |todo| %>

SELECT "customers".* FROM "customers" WHERE "customers"."id" = 1 LIMIT 1
SELECT "employees".* FROM "employees" WHERE "employees"."customer_id" IN (1)
---
            <% if !log.customer.nil? %>
            <% log.customer.employees.each do |employee| %>